#+TITLE: Python
#+AUTHOR: LavenLiu
#+DATE: 2010-05-04
#+EMAIL: ldczz2008@163.com 

#+LaTeX_CLASS: book
#+LaTeX_CLASS_OPTIONS: [a4paper,11pt]
#+LaTeX_HEADER: \usepackage[top=2.1cm,bottom=2.1cm,left=2.1cm,right=2.1cm]{geometry}
#+LaTeX_HEADER: \setmainfont[Mapping=tex-text]{Times New Roman}
#+LaTeX_HEADER: \setsansfont[Mapping=tex-text]{Tahoma}
#+LaTeX_HEADER: \setmonofont{Courier New}
#+LaTeX_HEADER: \setCJKmainfont[BoldFont={Adobe Heiti Std},ItalicFont={Adobe Kaiti Std}]{Adobe Song Std}
#+LaTeX_HEADER: \setCJKsansfont{Adobe Heiti Std}
#+LaTeX_HEADER: \setCJKmonofont{Adobe Fangsong Std}
#+LaTeX_HEADER: \punctstyle{hangmobanjiao}
#+LaTeX_HEADER: \usepackage{color,graphicx}
#+LaTeX_HEADER: \usepackage[table]{xcolor}
#+LaTeX_HEADER: \usepackage{colortbl}
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \usepackage[bf,small,indentafter,pagestyles]{titlesec}

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/style2.css" />

#+OPTIONS: ^:nil
#+OPTIONS: tex:t

** 字符串与bytes
Python3引入了bytes与bytearray两种数据类型。byte是Python3特有的。
Python2里不区分byte和str。Python3字符串默认使用utf-8编码。

如何定义bytes：
1. bytes可以通过str的encode方法转化得到
2. 通过b前缀定义bytes
#+BEGIN_SRC python :results output :exports both
  b = b'\xe9\xa9\xac'
  print(type(b))
  # bytes
#+END_SRC

#+RESULTS:
: <class 'bytes'>

字符串与bytes的对比：
1. str是文本序列
2. bytes是字节序列
3. string的所有操作bytes都支持

一些理论知识：
+ 文本是有编码的（utf-8，gbk，GB18030等）
+ 字节没有编码这种说法
+ 文本的编码指的是字符如何使用字节来表示
#+BEGIN_SRC python
# python2
type(b'xxx')
type('xxx')
type(u'xxx')
#+END_SRC

#+BEGIN_SRC python
b = b'xxxxx'
b.find(b'x')
0
#+END_SRC
bytes和str的区别在于bytes是byte的序列，而str是unicode的序列。

*str使用encode方法转化为bytes，bytes通过decode转化为str。*
#+BEGIN_SRC python
s = "马哥教育"
b = s.encode()
for x in b:
  print(x)
b.decode() # 默认参数是utf8
for x in b:
  print(x)

# 读取文件
# python3
echo "马哥教育" > utf8.txt
iconv -f UTF-8 -t gbk utf8.txt > gbk.txt
f = open('gbk.txt', 'rb')
buf = f.read()
buf
buf.decode('GBK')
s  = buf.decode('GBK')
s
type(buf)
print(buf)

f.close()
#+END_SRC
其实就是防止产生乱码。

在网络编程里，传输的内容是二进制的内容。如果是不同平台之间进行传输数
据，尽量明确指定encode及decode的编码及解码格式。
*** bytes操作
  除了encode外，str操作，都有对应bytes的版本，但是传入参数也必须是
  bytes。
  #+BEGIN_SRC python :results output :exports both
	b = b'abc'
	# print(b'abc'.find('b')) # 参数必须是bytes，此处会异常
	print(b'abc'.find(b'b')) # 1
	print('马哥教育'.encode().find(b'\xa9')) # 输出1。bytes的操作是按字节的
	print('马哥教育'.encode())
	print(len('马哥教育'.encode()))
	print(b.decode())
	print(b.hex())
  #+END_SRC

  #+RESULTS:
  : 1
  : 1
  : b'\xe9\xa9\xac\xe5\x93\xa5\xe6\x95\x99\xe8\x82\xb2'
  : 12
  : abc
  : 616263

** bytearray
 bytearray是bytes的可变版本。str和bytes是不可变的。
 #+BEGIN_SRC python :results output :exports both
   b = b'abc'
   # b[1] = b'B' # 这里赋值会抛出异常
   b = bytearray(b)
   print(type(b))
   b[1] = int(b'B'.hex(), 16)
   print(b)
 #+END_SRC

 #+RESULTS:
 : <class 'bytearray'>
 : bytearray(b'aBc')

 bytearray是可变的，为什么要可变呢？主要用在图片处理。相对bytes来说，
 多了insert，append，extend，pop，remove，clear，reverse这些方法，这
 些方法都是原地修改的，并且可以索引操作。

 append，insert，remove，count的参数必须是int类型。
* 函数
Python中，参数总是引用传递。

一切皆对象。所有对象都是引用。

值保存在栈空间，引用保存在堆空间。

函数是Python的最小作用域，组织代码的最小单元。

函数没有显式的return语句时，默认返回None。

函数只能返回一个值，如果return语句后面有多个逗号分隔的值，会自动的封
包成一个元组。

一个函数不能有多个return语句。函数遇到第一个return语句就返回了。执行
return语句，会返回到调用方的作用域，函数的作用域就被销毁了（垃圾回
收）。

#+BEGIN_SRC python :results output :exports both
  def add(x, y): # 函数定义def表示定义一个函数，紧接着是函数名，函数名后面用一对小括号列出参数，参数列表后面
	  ret = x + y
	  print('{} + {} = {}'.format(x, y, ret))
	  return x + y

  add(3, 5)

  add(y=3, x=5)
#+END_SRC

#+RESULTS:
: 3 + 5 = 8
: 5 + 3 = 8

定义函数时并不会执行函数体，当调用函数的时候，才会执行其中的语句块。
** 函数返回值
 return语句除了返回值之外，还会结束函数，return之后的语句将不会被执行。
 #+BEGIN_SRC python :resultsff output :exports both
   def add(x, y):
	   return x + y
	   print('hehe')
 #+END_SRC

 #+RESULTS:
 : None

 一个函数可以有多个return语句，执行到哪个return由哪个return返回结果
 并结束函数。
 #+BEGIN_SRC python :results output :exports both
   def guess(x):
	   if x > 3:
		   return '> 3'
	   return '<= 3'

   guess(3)
   guess(5)
 #+END_SRC

 #+RESULTS:

 再来看一个例子，
 #+BEGIN_SRC python :results output :exports both
   def fn(x):
	   for i in range(x):
		   if i > 3:
			   return i
	   else:
		   print('not bigger than 3')

   fn(10)
 #+END_SRC

 #+RESULTS:

 如果函数没有return语句呢？
 #+BEGIN_SRC python :results output :exports both
   def fn():
	   pass

   ret = fn()
   print(ret)
   print(type(ret))
 #+END_SRC

 #+RESULTS:
 : None
 : <class 'NoneType'>

 当函数没有return语句的时候，返回None。return None与return返回语句是
 等价的，通常用于结束函数。
** 函数嵌套
 函数可以嵌套定义。
 #+BEGIN_SRC python :results output :exports both
   def outter():
	   def inner():
		   print('inner')
	   print('outer')
	   inner()

   outter()
 #+END_SRC

 #+RESULTS:
 : outer
 : inner

** 函数作用域
 作用域是一个变量的可见范围，叫做这个变量的作用域。
 #+BEGIN_SRC python :results output :exports both :session
   # 定义在全局作用域中
   x = 1


   def inc():
	   """
	   函数内部是一个局部作用域
	   """
	   x += 1

   inc()
 #+END_SRC

 #+RESULTS:
 #+begin_example
 inc()
 Traceback (most recent call last):
   File "<stdin>", line 1, in <module>
   File "<stdin>", line 5, in inc
 UnboundLocalError: local variable 'x' referenced before assignment
 #+end_example

 再看一个例子：
 #+BEGIN_SRC python :results output :exports both
   def fn():
	   xx = 1 # 上级作用域对下级作用域只读可见
	   print(xx)
	   def inner():
		   xx = 2 # 赋值即定义，在下级作用域里面，重新定义了xx
	   inner()
	   print(xx)

   fn()
 #+END_SRC

 #+RESULTS:
 : 1
 : 1

 作用域总结：
 1. 变量的作用域为
 2. 上级的作用域对下级作用域是只读可见
 3. 赋值即定义
 4. 不同作用域变量不可见，但是下级作用域可以对上级作用域的变量只读可见
*** global全局变量
  #+BEGIN_SRC python :results output :exports both
	xx = 1
	def fn():
		global xx # 可以提升变量作用域为全局变量
		xx += 1

	fn()
	print(xx)
  #+END_SRC

  #+RESULTS:
  : 2

  如果只是使用global提升变量，但并没有赋值呢？
  #+BEGIN_SRC python :results output :exports both :session
	def fn():
		global zz

	fn()
	print(zz)
  #+END_SRC

#+RESULTS:
#+begin_example
def fn():
global zz

fn()
print(zz)
Traceback (most recent call last):
 File "<stdin>", line 1, in <module>
NameError: name 'zz' is not defined


#+end_example

  再来看一个例子，
  #+BEGIN_SRC python :results output :exports both :session
	def fn():
		global zz
		zz = 3
		print(zz)

	def fn2():
		zz += 1
		print(zz)

	fn()

	fn2()
  #+END_SRC

#+RESULTS:
#+begin_example
def fn():
global zz
zz = 3
print(zz)

def fn2():
zz += 1
print(zz)

fn()
3

fn2()
Traceback (most recent call last):
 File "<stdin>", line 1, in <module>
 File "<stdin>", line 2, in fn2
UnboundLocalError: local variable 'zz' referenced before assignment


#+end_example

  global的提升只对本作用域有用，如果要在其他非全局作用域使用，也需要
  做同样的提升。

  对上面的例子进行修改，在fn2函数中使用global，
  #+BEGIN_SRC python :results output :exports both
	def fn():
		global zz
		zz = 3
		print(zz)

	def fn2():
		global zz
		zz += 1
		print(zz)

	fn()

	fn2()
  #+END_SRC

#+RESULTS:
: 3
: 4

  一个闭包的例子：
  #+BEGIN_SRC python :results output :exports both
	def counter():
		c = [0]
		def inc():
			c[0] += 1
  #+END_SRC

*** nonlocal关键字
  #+BEGIN_SRC python :results output :exports both :session
	def counter():
		x = 0
		def inc():
			nonlocal x # nonlocal关键字用于标记
			x += 1
			return x
		return inc

	f = counter()
	f()
  #+END_SRC

  #+RESULTS:
  : f = counter()
  : f()
  : 1

  如果上级作用域没有定义此变量的话，会抛出语法错误。

  对上级作用域的变量可写，使用nonlocal。

  全局变量总结：
  1. 提升只是标记，并没有定义变量，还需要在某处定义变量
  2. 除非你清楚的知道global会带来什么，并且明确的知道非global不行，否则不要使用global
*** 默认参数作用域
  函数也是对象，参数是函数对象的属性，所以函数参数的作用域伴随函数整
  个生命周期。

  使用不可变类型做为默认值。函数体内不改变默认值。
  #+BEGIN_SRC python :results output :exports both
	def fn(lst=None):
		if lst is None:
			lst = []
		lst.append(3)
		print(lst)
	print(fn.__defaults__)
	fn()
	fn()
  #+END_SRC

  #+RESULTS:
  : (None,)
  : [3]
  : [3]

** 递归函数
 Python标准的解释器没有针对尾递归做优化，任何递归函数都存在栈溢出的
 问题。为了保护解释器，Python对最大递归深度有限制。
 #+BEGIN_SRC python :results output :exports both
   import sys
   print(sys.getrecursionlimit())
 #+END_SRC

 #+RESULTS:
 : 1000

** 高阶函数
返回函数或者参数是函数的函数，就可以称为高阶函数。

高阶函数（Higher-order function）。函数是一等对象。

函数也是对象，并且它可以像普通对象一样赋值，作为参数，作为返回值。

#+BEGIN_SRC python :results output :exports both
def counter(base):
	def inc(x=1):
		nonlocal base
		base += x
		return base
	return inc

inc = counter(3)
print(inc(3))
#+END_SRC

#+RESULTS:
: 6

变量可以指向函数，以Python的abs函数为例，
 #+BEGIN_SRC python
abs(-10)
10
 #+END_SRC
但是，如果只写abs呢？
 #+BEGIN_SRC python
>>> abs
<built-in function abs>
 #+END_SRC

可见，abs(-10)是函数调用，而abs是函数本身。要想获得函数调用结果，我们可以把结果赋值给变量：
 #+BEGIN_SRC python
>>> x = abs(-10)
>>> x
10
 #+END_SRC

但是，如果把函数本身赋值给变量呢？
 #+BEGIN_SRC python
>>> f = abs
>>> f
<built-in function abs>
 #+END_SRC

结论：函数本身也可以赋值给变量，即：变量可以指向函数。如果一个变量指向了一个函数，那么，可以通过该变量来调用这个函数，
 #+BEGIN_SRC python
>>> f = abs
>>> f(-10)
10
 #+END_SRC
** 返回函数
 返回函数或者参数是函数的函数 -- 高阶函数。

 Python中的函数是一等对象。函数也是对象，并且它可以像普通对象一样赋
 值，作为参数或返回值。

 #+BEGIN_SRC python
   #!/usr/bin/env python

   def cacl2(s):
	   """
	   def f_add(a, b): return a + b
	   def f_mul(a, b): return a * b
	   def f_sub(a, b): return a - b
	   """

	   if s == '+':
		   return lambda a, b: a + b
	   if s == '*':
		   return lambda a, b: a * b
	   if s == '-':
		   return lambda a, b: a - b
	   else:
		   assert False, "error: operator not defined"

   # 可以使用字典的形式
   calc_dict = {
	   '+': lambda a, b: a + b,
	   '*': lambda a, b: a * b,
	   '-': lambda a, b: a - b,
   }
 #+END_SRC

 高阶函数的例子，
 #+BEGIN_SRC python :results output :exports both
   def sort(iterator, cmp=lambda a, b: a < b):
	   ret = []
	   for x in iterator:
		   for i, e in enumerate(ret):
			   if cmp(x, e):
				   ret.insert(i, x)
				   break
		   else:
			   ret.append(x)
	   return ret

   print(sort([1, 3, 2, 4, 6, 8, 5], lambda a, b: a > b))
 #+END_SRC

 #+RESULTS:
 : [8, 6, 5, 4, 3, 2, 1]

 上述例子是逆序输出，如果我们要顺序输出，那么就要修改上述代码。

 使用场景：
 1. 函数作为返回值：通常是用于闭包的场景，需要封装一些变量
 2. 函数作为参数：通常用于大多数逻辑固定，少部分逻辑不固定的场景
 3. 函数作为参数，返回值也是函数：通常用于作为参数函数执行前后需要一些额外操作（装饰器）

 同时使用上述两种场景的例子：
 #+BEGIN_SRC python :results output :exports both
   def logger(fn):
	   def wrap(*args, **kwargs):
		   print('call {}'.format(fn.__name__))
		   ret = fn(*args, **kwargs)
		   print('{} called'.format(fn.__name__))
		   return ret
	   return wrap

   def add(x, y):
	   return x + y

   logged_add = logger(add)
   logged_add(3, 5)
 #+END_SRC

 #+RESULTS:
 : call add
 : add called

 再来一个例子：
 #+BEGIN_SRC python :results output :exports both
   import time
   import datetime


   def logger(fn):
	   def wrap(*args, **kwargs):
		   start = datetime.datetime.now()
		   ret = fn(*args, **kwargs)
		   end = datetime.datetime.now()
		   print('call {} took {}.'.format(fn.__name__, end - start))
		   return ret
	   wrap.__name__ = fn.__name__
	   wrap.__doc__ = fn.__doc__
	   return wrap


   @logger
   def sleep(x):
	   time.sleep(x)

   print(sleep.__name__)
 #+END_SRC

 #+RESULTS:
 : sleep

 针对上面的例子，我们可以把如下的部分封装为一个函数，
 #+BEGIN_SRC python
   wrap.__name__ = fn.__name__
   wrap.__doc__ = fn.__doc__   
 #+END_SRC

 定义copy_properties函数，
 #+BEGIN_SRC python
   def copy_properties(src, dst):
	   dst.__name__ = src.__name__
	   dst.__doc__ = src.__doc__
 #+END_SRC

 最后，上面的代码可以改写为：
 #+BEGIN_SRC python :results output :exports both
   import time
   import datetime


   def copy_properties(src, dst):
	   dst.__name__ = src.__name__
	   dst.__doc__ = src.__doc__


   def logger(fn):
	   def wrap(*args, **kwargs):
		   start = datetime.datetime.now()
		   ret = fn(*args, **kwargs)
		   end = datetime.datetime.now()
		   print('call {} took {}.'.format(fn.__name__, end - start))
		   return ret
	   copy_properties(fn, wrap)
	   return wrap
 #+END_SRC

 使用一个多余函数copy_properties是不是有些繁琐？还好标准库给我们提供
 了方便的方法，这里我们使用functools库提供的wraps方法，上面的代码改
 写如下：
 #+BEGIN_SRC python :results output :exports both
   import time
   import datetime
   import functools


   def logger(fn):
	   @functools.wraps(fn)
	   def wrap(*args, **kwargs):
		   start = datetime.datetime.now()
		   ret = fn(*args, **kwargs)
		   end = datetime.datetime.now()
		   print('call {} took {}.'.format(fn.__name__, end - start))
		   return ret
	   return wrap


   @logger
   def sleep(x):
	   time.sleep(x)


   print(sleep.__name__)
 #+END_SRC

 #+RESULTS:
 : sleep

** 回调函数
 函数作为参数
 #+BEGIN_SRC python :results output :exports both
   def test(callback):
	   print('test func begin')
	   callback()
	   print('test func end')


   def cb1():
	   print('callback 1')


   def cb2():
	   print('callback 2')


   test(cb1)
   test(cb2)
 #+END_SRC

 #+RESULTS:
 : test func begin
 : callback 1
 : test func end
 : test func begin
 : callback 2
 : test func end

 一个例子：
 #+BEGIN_SRC python :results output :exports both
   def test(callback):
	   print('test func begin')
	   callback()

   def test1(callback):
	   print('test1 func begin')
	   for func in callback:
		   func()

   def cb1():
	   print('callback 1')


   def cb2():
	   print('callback 2')


   if __name__ == '__main__':
	   test(cb1)
	   test(cb2)
	   test1([cb1, cb2])
 #+END_SRC

 #+RESULTS:
 : test func begin
 : callback 1
 : test func begin
 : callback 2
 : test1 func begin
 : callback 1
 : callback 2


 一个应用场景：不同顾客有不同的响应要求
 + 有的顾客通知要发邮件
 + 有的顾客通知要发QQ
 + 有的要发微信
 + 有的要短信

 要求： 文本文件，注册一个通知方式，一个地址，注册后通知消息就跟已注
 册的一起发送。
 #+BEGIN_SRC python :results output :exports both
   def send_weixin(addr, message):
	   print(u"发微信(" + message + u")给" + addr)


   def send_email(addr, message):
	   print(u"发邮件(" + message + u")给" + addr)


   def send_qq(addr, message):
	   print(u"发QQ(" + message + u")给" + addr)


   def send_msm(addr, message):
	   print(u"发短信(" + message + u")给" + addr)


   send_method = {
	   'QQ': send_qq,
	   'WeiXin': send_weixin,
	   'DuanXin': send_msm,
	   'Email': send_email
   }


   """
   def gupiao(f, message, custom_file, vip=False):
	   # 处理message
	   # 判断是否是VIP
	   # 解析文件，得到地址
	   # f(message, addr)
	   pass

   gupiao(send_method['QQ'], message, file_qq)
   gupiao(send_method['WeiXin'], message, file_weixin)
   gupiao(send_method['DuanXin'], message, file_duanxin)
   gupiao(send_method['Email'], message, file_email)
   """


   def gupiao(message, custom_file, vip=False):
	   send_s = []
	   for s in message:
		   if vip == False:
			   t = s.split(',')
			   send_s.append(t[0])
		   else:
			   send_s.append(s)

	   send_message = ';'.join(send_s)

	   # callback
	   for line in open(custom_file, 'r'):
		   info = line.strip().split(',')
		   send_method[info[0]](info[1], send_message)

   if __name__ == '__main__':
	   gupiao([u"000001买,低于8.5买", u"000002卖,高于11.2卖"], 'custom_file.txt')
	   print('####### VIP #######')
	   gupiao([u"000001买,低于8.5买", u"000002卖,高于11.2卖"], 'custom_file.txt', vip=True)
 #+END_SRC

 #+RESULTS:

 所需的顾客的信息：
 #+BEGIN_EXAMPLE
 # file_name: custom_file.txt
 QQ, 13242882, chenxiansheng
 WeiXin, airman, liuxiansheng
 DuanXin, 13166668888, wangxiaojie
 Email, 111@163.com, zhanglingdao
 #+END_EXAMPLE
** 闭包closure
 绑定外部变量的函数。

 闭包closure：
 1. 嵌套函数
 2. 内部函数用到了外部变量（通常是外部函数的参数）
 3. 外部函数返回内部函数

 #+BEGIN_SRC python :results output :exports both
   def pow_x(x):
	   def echo(value):
		   return value ** x
	   return echo

   lst = [pow_x(2), pow_x(3), pow_x(4)]
   for p in lst:
	   print(p(2))
 #+END_SRC

 #+RESULTS:
 : 4
 : 8
 : 16

 1. 内部函数不能“改变”外部变量
 2. 内部函数用到了外部变量为list，则可以从外部或内部改变值，并且即使
	外部没有引用也不会回收
**** BytesIO(二进制模式)
   #+BEGIN_SRC python :results output :exports both
	 from io import BytesIO

	 bio = BytesIO()
	 bio.write(b'abcd')
	 bio.seek(0)
	 print(bio.read())
	 bio.close()
   #+END_SRC

   #+RESULTS:
   : b'abcd'

   BytesIO还有一个getvalue的方法，可以一次性读取全部内容，不管文件指针在哪里。
*** 路径相关操作
  在python3.4之前，使用os.path以字符串的形式操作路径。在Python3.4之
  后，是使用pathlib以面向对象的方式操作路径。

  #+BEGIN_SRC python
os.path.basename('/tmp/file') # file
os.path.dirname('/tmp/file') # /tmp
os.path.join('/', 'tmp', 'file') # /tmp/file
os.path.split('/tmp/d/file') # ('/tmp/d', 'file')
os.path.abspath()
os.path.getcwd()
  #+END_SRC

  获得脚本所在目录的绝对路径，
  #+BEGIN_SRC python
os.path.abspath(os.path.dirname(sys.argv[0]))
  #+END_SRC

  #+BEGIN_SRC python :results output :exports both
	import pathlib

	cwd = pathlib.Path('.')
	print(cwd)
	cwd.is_dir()

	cwd.iterdir() # 对当前目录进行遍历，不会进行递归的遍历
  #+END_SRC

  #+RESULTS:
  : .

  创建目录，
  #+BEGIN_SRC python :results output :exports both
	import pathlib

	cwd = pathlib.Path('./abcd')
	d.exists()
	d.mkdir(0o755)
  #+END_SRC

  删除目录时，要删除的目录是空目录。

  通用操作，
  #+BEGIN_SRC python :results output :exports both
	import pathlib

	f = pathlib.Path('./abcd')
	f.exists() # 判断路径是否存在
	f.is_file() # 当路径不存在时，is_*方法都返回False
	f.is_dir()

	f = pathlib.Path('./hello.py')
	f.is_file() # 判断是否是文件
	f.is_absolute() # 判断是否为绝对路径
	f.absolute() # 返回绝对路径
	f.absolute().as_uri() # 转换为URI的形式，如file:///path/to/file
	f.cwd() # 路径或文件所在的当前目录
	f.drive # Windows系统特有的，在Unix下为返回空字符
  #+END_SRC
** 面向对象基础
面向对象是一种编程范式。范式是指一组方法论。编程范式是一组如何组织
代码的方法论。

数据库的三范式。

编程范式指的是软件工程中的一种方法学。

主流的编程范式：
1. OOP	- 面向对象编程
#+BEGIN_EXAMPLE
世界观：一切皆对象
#+END_EXAMPLE
2. FP	- 函数式编程
#+BEGIN_EXAMPLE
世界观：一切皆函数。一般指无副作用的函数。
#+END_EXAMPLE
3. PP	- 过程化编程
4. IP	- 指令式编程
5. LP	- 逻辑化编程
6. AOP	- 面向方面编程 装饰器

设计模式：
1. 自顶向下
2. 自底向上

大问题切割成小问题。对世界抽象的不够。

面向对象更进一步的抽象了世界。OOP的世界观：
1. 世界是由对象组成的
2. 对象具有运动规律和内部状态
3. 对象之间可以相互作用

面向对象的特性：
1. 唯一性：对象都是唯一的，不存在两个相同的对象，除非他们是同一个对象。
2. 分类性：对象是可分类的，世界是由不同的类型组成的。

面向对象的三大特征：
1. 封装
2. 继承
3. 多态

面向对象的本质：对行为和数据的封装；有时候数据就是数据；有时候行为就是行为。
#+BEGIN_SRC python :results output :exports both
from collections import namedtuple

Pet = namedtuple('Pet', ['name', 'age'])
#+END_SRC

目的是为了组织数据。命名元组的优势：组织的更好，字段有名字。
#+BEGIN_SRC python :results output :exports both
from collections import namedtuple

Door = namedtuple('Door', ['number', 'status'])

# 实例化
door = Door(1001, 'closed')
print(door.status)
print(door.number)
#+END_SRC

#+RESULTS:
: closed
: 1001

以面向对象的方式实现Door，
#+BEGIN_SRC python :results output :exports both
class Door:
	def __init__(self, number, status):
		# . 用于访问对象的属性及方法
		self.number = number
		self.status = status

door = Door(1001, 'closed')
print(door.number)
print(door.status)
#+END_SRC

#+RESULTS:
: 1001
: closed

#+BEGIN_SRC python :results output :exports both
class B:
	def __init__(self, a, b, c, d):
		print(a)
		print(b)
		print(c)
		print(d)

b = B(1, 2, 3, 4)
#+END_SRC

#+RESULTS:
: 1
: 2
: 3
: 4

1. 创建对象使用类名 /__init__ 函数除第一个参数外的参数列表/
2. 创建对象的时候实际执行了 /__init__函数/

*** 实例化的过程
  #+BEGIN_SRC python
class Heap:
  def __init__(self): # 此函数通常叫做构造函数，在Python中更多叫做初
					  # 始化函数，在对象创建完成后会立刻执行
	  self.data = []

  def add(self, x): # 第一个参数是self，其他参数与函数定义一样
	  pass

  def pop(self):
	  pass
  #+END_SRC
  self代表这个实例。

  一个示例，
  #+BEGIN_SRC python :results output :exports both
class Door:
  def __init__(self, number, status):
	  self.number = number
	  self.status = status

  def open(self):
	  self.status = 'opened'

  def close(self):
	  self.status = 'closed'

door = Door(1, 'closed') # 看起来非常像一个函数调用。事实上，
					   # 确实发生了一些函数调用，它调用了__init__函数，
					   # 第一个参数由解释器自动传入，表示实例本身，
					   # 通常命名为self
print(door.__class__)
print(Door.__class__)
print(type.__class__)
# 所有类，都是type或者type的子类的实例
  #+END_SRC

  #+RESULTS:
  : <class '__main__.Door'>
  : <class 'type'>
  : <class 'type'>

__init__函数并不会创建对象，__init__函数初始化对象。对象创建过程为：
1. 首先创建对象
2. 对象作为self参数传递给__init__函数
3. 返回self

实例怎么来的？由类的__new__方法实现。如果要改变默认的创建实例的行
为，可以写__new__方法，但通常是不写的。
  #+BEGIN_SRC python :results output :exports both
class Door:
#    def __new__(cls): # 创建实例的，可以改变实例创建的行为，这就是元编程的体现
#        pass

  def __init__(self, number, status):
	  self.number = number
	  self.status = status

  def open(self):
	  self.status = 'opened'

  def close(self):
	  self.status = 'closed'

door = Door(1, 'closed') # 看起来非常像一个函数调用。事实上，
					   # 确实发生了一些函数调用，它调用了__init__函数，
					   # 第一个参数由解释器自动传入，表示实例本身，
					   # 通常命名为self
print(door.__class__)
print(Door.__class__)
print(type.__class__)
# 所有类，都是type或者type的子类的实例
  #+END_SRC

  #+RESULTS:
  : <class '__main__.Door'>
  : <class 'type'>
  : <class 'type'>

实例化的时候，传递的参数列表是__init__方法除了第一个参数之外的所有
参数，支持函数的所有参数变化。

当没有显式的定义__init__方法的时候，会使用默认的__init__方法，
  #+BEGIN_SRC python
def __init__(self):
  pass
  #+END_SRC

通过.操作符访问实例的属性或者调用实例的方法。当我们调用实例方法的
时候，第一个参数即实例本身，由解释器自动传入。
**** 类的作用域
   #+BEGIN_EXAMPLE
   实例变量的作用域是在实例内部。

   所有实例共享类变量。赋值会产生新的变量。

   实例可以动态增减属性。

   类变量可以通过类直接访问，而且通过类修改变量，会影响所有实例。

   方法的作用域是类级别的。
   #+END_EXAMPLE

   结合一个简单的例子说明，
  #+BEGIN_SRC python
class Door:
  type = 'A' # 类的直接下级作用域的变量，叫做类变量

  def __init__(self, number, status):
	  self.number = number # 关联到实例的变量，叫做实例变量
	  self.status = status

  def open(self):
	  self.status = 'opened'

  def close(self):
	  self.status = 'closed'

d1 = Door(1, 'closed')
d2 = Door(2, 'opened')

d2.open = lambda self: print('haha fuck it') # monkey path
d2.open()
d1.open()
  #+END_SRC

  类变量对类和实例都可见。再看一个例子：
  #+BEGIN_SRC python :results output :exports both
	class E:
		NAME = 'E'

		def __init__(self, name):
			self.name = name

	e = E('e')

	print(e.NAME) # 等价于e.__class__.NAME
	print(e.__class__.NAME)
	e.NAME = 'xxx' # 等价于e.__dict__['NAME'] = 'xxx'
	print(e.NAME)
	print(e.__class__.NAME)
  #+END_SRC

#+RESULTS:
: E
: E
: xxx
: E

  属性的查找顺序为：
  1. __dict__
  2. __class__

  *赋值即创建*
**** 类装饰器
   先来个例子热热身：
   #+BEGIN_SRC python :results output :exports both
	 def set_name(cls, name):
		 cls.NAME = name
		 return cls


	 class F:
		 pass

	 F1 = set_name(F, 'F')
	 f1 = F1()
	 print(F1.NAME)
	 print(f1.NAME)
   #+END_SRC

#+RESULTS:
: F
: F

   以装饰器的方式实现：
   #+BEGIN_SRC python :results output :exports both
	 def set_name(name):
		 def wrap(cls):
			 cls.NAME = name
			 return cls
		 return wrap


	 @set_name('G')
	 class G:
		 pass

	 print(G.NAME)

	 # 上述过程等价于下面的几行代码：
	 # class G:
	 #     pass

	 # G = set_name('G')(G)
   #+END_SRC

#+RESULTS:
: G

   上面的例子是给类动态增加属性，下面给类动态增加方法：
   #+BEGIN_SRC python :results output :exports both
	 def print_name(cls):
		 def get_name(self):
			 return cls.__name__
		 cls.__get_name__ = get_name
		 return cls


	 @print_name
	 class H:
		 pass

	 h = H()
	 print(h.__get_name__())
   #+END_SRC

#+RESULTS:
: H

   类装饰器通常用于给类增加属性。
**** 类方法/静态方法
   方法都是类级的。方法的定义都是类级的，但是有的方法使用实例调用，
   有的方法使用类来调用。什么样的方法使用类来调用呢？接下来看一个例子：
   #+BEGIN_SRC python :results output :exports both
	 class I:
		 def instance_print(self):
			 print('instance method')

		 @classmethod # 当一个方法被classmethod装饰的时候，第一个参数会变成类本身，这样的方法叫类方法
		 def class_print(cls):
			 print(id(cls))
			 print('class method')

		 @staticmethod # 当一个方法，被staticmethod装饰的时候，不会自动传递第一个参数，这样的方法叫静态方法
		 def static_print():
			 print('static method')

		 def xxx_print(): # 在类中定义的一个方法（函数）；与staticmethod的区别是，该方法不能被实例调用
			 print('this is a function')

	 i = I()
	 i.instance_print() # 实例调用实例方法时，会自动传入self参数，self为实例本身 I.instance_print(i)
	 I.class_print()
	 print(id(I))
	 i.class_print() # 类方法可以被实例调用，并且被实例使用时，传入的参数还是类
	 i.static_print()
	 I.static_print()
	 I.xxx_print()
	 # i.xxx_print()
   #+END_SRC

#+RESULTS:
: instance method
: 4302355800
: class method
: 4302355800
: 4302355800
: class method
: static method
: static method
: this is a function

  实例方法只能又实例调用。实例方法与类方法，实例方法和类方法的区别在
  于传入的第一个参数，实例方法会自动传入当前实例，类方法会自动传入当
  前类。类方法可以被实例使用，并且被实例使用时，传入的第一个参数还是
  类。
  #+BEGIN_SRC python
class A:
  def method_of_instance(self):
	  print('method of instance')

  @classmethod
  def method_of_class(cls):
	  print('method of class')

a = A()
a.method_of_instance()
a.method_of_class()

A.method_of_instance()
A.method_of_class()
  #+END_SRC

  再看一个例子，当我们用实例调用方法的时候，总是会传入一个参数，
  要么是实例本身，要么是它的类。
  #+BEGIN_SRC python
class A:
  def method_of_instance(self):
	  print('method of instance')

  @classmethod
  def method_of_class(cls):
	  print('method of class')

  @staticmethod
  def static_method(): # 这就是静态方法，静态方法不能由实例调用
					   # 通常，我们会加@staticmethod装饰器作为标示，
					   # @staticmethod装饰器不做任何事情
	  print('static method')

a = A()
a.method_of_instance()
a.method_of_class()
a.static_method()

A.method_of_instance()
A.method_of_class()
A.static_method()
A.method_of_instance(a)

# 实例调用方法的时候，始终会传入实例本身作为第一个参数；
# 类  调用方法的时候，始终不会传递本身作为第一个参数；
# @classmethod 装饰器会向方法传递一个参数，传递的是类本身；
  #+END_SRC

  方法的作用域都属于类级别，具体是实例方法，还是类方法，或者是静态方
  法，由第一个参数决定，当第一个参数是实例的时候，是实例方法；当第一
  个参数是类的时候，是类方法，当不要求第一个参数时，是静态方法。

  #+BEGIN_SRC python
class A:
  var = 'A'

  @classmethod
  def change_var(cls, val):
	  cls.var = val

a1 = A()
a2 = A()

A.change_var('B')
a1.var
a2.var

a1.change_var('C')
a1.var
a2.var
  #+END_SRC

  再来看一个例子：
  #+BEGIN_SRC python :results output :exports both
	class Car:
		country = u"中国"

		def __init__(self, length, width, height, owner=None):
			self.owner = owner
			self.length = length
			self.width = width
			self.height = height
			self.country = "china"

	if __name__ == '__main__':
		a = Car(1.2, 1.4, 1.5, u"大川")
		b = Car(2.2, 2.4, 2.5, u"淘气")
		print(a.owner, b.owner)
		print(a.country, b.country)

		b.country = u"美国"
		print(a.country, b.country)
		print(Car.country)
		print("-------------------")
		del a.country
		print(a.country)
  #+END_SRC

#+RESULTS:
: 大川 淘气
: china china
: china 美国
: 中国
: -------------------
: 中国

  所有实例需要共享一些状态、数据的时候，就可以使用类变量。当在实例中
  需要修改类变量的时候，我们就可以把修改的内容放到类方法中。

  类变量被赋值的话（赋值会产生新的引用），就会变成了实例变量。
**** 访问控制
   这里主要涉及公有变量、私有变量及公有方法、私有方法。
   #+BEGIN_SRC python :results output :exports both
	 class Door:
		 def __init__(self, number, status):
			 self.number = number
			 self.__status = status

		 def open(self):
			 self.__status = 'opening'

		 def close(self):
			 self.__status = 'closed'

		 def status(self):
			 return self.__status

		 def __set_number(self, number):
			 self.number = number

	 door = Door(1001, 'closed')
	 # door.__status # 报错
	 door.__status = 'fuck it'
	 print(door.__status)
	 door.status()
	 door.open()
	 door.status()
	 # door.__set_number(5001)
	 print(door._Door__status)
   #+END_SRC

#+RESULTS:
: fuck it
: opening

   所有双下划线，非双下划线结尾的成员，都是私有成员。对于上述
   的__status私有变量，如何进行访问呢？在Python中，可以通过
   #+BEGIN_SRC python
   _类名+带双下划线的属性
   #+END_SRC
   Python的私有成员是通过改名实现的。严格地说，Python里没有真正的私
   有成员。除非真的有必要，并且清楚知道会有什么后果，否则不要用这个
   黑魔法。90%的程序员有生之年用不到。

   接下来再看看以单下划线开始的变量，
   #+BEGIN_SRC python :results output :exports both
	 class J:
		 def __init__(self):
			 self._a = 3

	 j = J()
	 print(j._a)
	 j._a = 4
	 print(j._a)
	 print(j.__dict__)
   #+END_SRC

#+RESULTS:
: 3
: 4
: {'_a': 4}

   单下划线开始的变量是一种惯用法，标记此成员为私有，但是解释器不做
   任何处理。

   接下来介绍property装饰器，
   #+BEGIN_SRC python :results output :exports both
	 class Door:
		 def __init__(self, number, status):
			 self.number = number
			 self.__status = status

		 def open(self):
			 self.__status = 'opening'

		 def close(self):
			 self.__status = 'closed'

		 @property # property装饰器会把一个仅有self参数的函数，变成一个属性，属性的值为方法的返回值
		 def status(self):
			 return self.__status

		 def __set_number(self, number):
			 self.number = number

	 door = Door(1001, 'closed')
	 print(door.status)
	 # door.status() # 会报错
   #+END_SRC
*** 封装
  一个例子，
  #+BEGIN_SRC python
Heap = namedtuple('Heap', ['add', 'pop'])

def heap_factory():
  data = []

  def add(x):
	  pass

  def pop():
	  pass

  return Heap(add, pop)

heap = heap_factory()
# 对外界来说，data是不可见的，外界无法访问data
  #+END_SRC

  在Python中如何进行封装的？来看一个小例子，
  #+BEGIN_SRC python :results output :exports both
class A:
  def __init__(self, x, y, z):
	  self.x = x
	  self.y = y
	  self.z = z

a = A(1, 2, 3)
print(a.x)
print(a.y)
print(a.z)
a.x = 2
print(a.x)
  #+END_SRC

#+RESULTS:
: 1
: 2
: 3
: 2

  下面是封装的例子，
  #+BEGIN_SRC python
class B:
  def __init__(self, x, y, z):
	  self.x = x
	  self.__y = y
	  self._z = z

b = B(1, 2, 3)
b.x
b.__y
b._z
  #+END_SRC

  在Python中，以双下划线开始，并且不以双下划线结尾的变量，是私有变量，
  外界无法直接访问。通常，我们不定义以双下线开始，双下划线结尾的变量
  和方法，因为这在Python中有特殊含义。

  接下来看看私有方法，方法也是一样的规则，以双下划线开头，非双下划线
  结尾的方法是私有方法。
  #+BEGIN_SRC python
class D:
  def __private_method(self):
	  print('private method')

d = D()
d.__private_method()

# 通过dir(d)时，也看不到__private_method()方法。
  #+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
Traceback (most recent call last):
File "<stdin>", line 6, in <module>
AttributeError: 'D' object has no attribute '__private_method'
#+END_EXAMPLE

  一个稍微综合的例子，
  #+BEGIN_SRC python :results output :exports both
class F:
  __private_class_var = u'私有类变量'

  def __init__(self):
	  self.__private_instance_var = u'私有实例变量'

  @classmethod
  def public_class_method(cls):
	  print(cls.__private_class_var)

  def public_instance_method(self):
	  print(self.__private_class_var)
	  print(self.__private_instance_var)

f = F()
f.public_class_method()
f.public_instance_method()
  #+END_SRC

#+RESULTS:
: 私有类变量
: 私有类变量
: 私有实例变量

  私有属性在类的内部均可访问，无论是类方法还是实例方法。接下来再看一
  个稍微变态的例子，
  #+BEGIN_SRC python :results output :exports both
class G:
  __private_class_var = 'private class var'

  def public_instance_method(self):
	  print(G.__private_class_var)

g = G()
g.public_instance_method()
G.__private_class_var # 会提示没有这个对象
  #+END_SRC

#+RESULTS:

  再来一个例子，
  #+BEGIN_SRC python
class H:
  __private_class_var = 'private class var'

  @staticmethod
  def public_static_method():
	  print(H.__private_class_var)

h = H()
h.public_static_method()
H.public_static_method()
  #+END_SRC

  前面说过，类的私有属性是不能直接被访问的，这是真的吗？接着看F这个例子，
  #+BEGIN_SRC python
class F:
  __private_class_var = 'private class var'

  def __init__(self):
	  self.__private_instance_var = 'private instance var'

  @classmethod
  def public_class_method(cls):
	  print(cls.__private_class_var)

  def public_instance_method(self):
	  print(self.__private_class_var)
	  print(self.__private_instance_var)

f = F()
f.public_class_method()
f.public_instance_method()

# 使用__dict__查看实例f的属性
f.__dict__
f._F__private_instance_var
  #+END_SRC

  事实上，Python的私有属性并不是真正私有，而是一个变量重命名而已。看
  一个例子说明此问题：
  #+BEGIN_SRC python
class J:
  def __init__(self):
	  self.__a = 1
	  self.__b = 2

  def __private_method(self):
	  print('private method')

j = J()
j._J__a
j._J__private_method()
  #+END_SRC

  一个综合点的例子，
  #+BEGIN_SRC python
	class Door:
		def __init__(self, number, status):
			self.number = number
			self.__status = status

		def open(self):
			self.__status = 'opened'

		def close(self):
			self.__status = 'closed'

		def get_status(self):
			return self.__status

		@property
		def status(self):
			"""
			使用property装饰器描述符对status方法进行装饰，
			可以让我们访问status方法像访问类的属性一样。
			"""
			return self.__status

	door = Door(1, 'number')
	door.open()
	door.status = 'opened'
	door.get_status()
	door.status # 属性
  #+END_SRC

  还想对status进行赋值，但赋值只能是opened或closed，该怎么破？
  #+BEGIN_SRC python
class Door:
  def __init__(self, number, status):
	  self.number = number
	  self.__status = status

  def open(self):
	  self.__status = 'opened'

  def close(self):
	  self.__status = 'closed'

  @property # @proverty装饰器，可以把方法装饰成了一个同名属性
  def status(self):
	  return self.__status

  @status.setter # @xxxx.setter xxxx代表被@property装饰的属性吗，当对此属性赋值时，会调用此方法
  def status(self, value):
	  if value in ('closed', 'opened'):
		  self.__status = value
	  else:
		  raise ValueError(value)

  @status.deleter # 当删除此属性时，会调用此方法
  def status(self):
	  raise NotImplementedError('You can not delete status of door')

door = Door(1, 'number')
door.open()
door.status # 属性
door.status = 'xxxx'
door.get_status()
door.status
door.status = 'closed'

del door.status
  #+END_SRC
*** 什么是异常类
  BaseException的所有子类都是异常类。
  #+BEGIN_SRC python :results output :exports both
print(Exception.__mro__)
print(TypeError.__mro__)
  #+END_SRC

#+RESULTS:
: (<class 'Exception'>, <class 'BaseException'>, <class 'object'>)
: (<class 'TypeError'>, <class 'Exception'>, <class 'BaseException'>, <class 'object'>)

  except后面可以跟一个异常类，这时候，它仅仅捕获此类异常。
  #+BEGIN_SRC python :results output :exports both
try:
  raise TypeError() # 明确指定抛出TypeError异常
except TypeError:     # 明确指出捕获TypeError异常
  print('type error')
  #+END_SRC

#+RESULTS:
: type error

  #+BEGIN_SRC python :results output :exports both
try:
  raise Exception() # 明确指定抛出异常
except TypeError:     # 明确指出捕获TypeError异常，但捕获不到
  print('type error')
  #+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:  File "<stdin>", line 2, in <module>
: Exception

  由于except的模式匹配，可以针对不同的异常做不同的处理。

*** expect语句优先级
  一个try语句可以带多个except语句。异常有优先级的，来看上面的代码，并做稍微修改，
  #+BEGIN_SRC python
# 以普通用户执行
try:
  open('/root/test.txt')
except Exception:
  print('error')
except PermissionError:
  print('Permission Denied')
# 输出的结果为
error
  #+END_SRC

  当有多个except时，从上往下，匹配到第一条就停止匹配。通常会把具体的
  异常放到上面，一般性的异常放到下面。通常来说，子类更具体，父类更一
  般。还以上面的例子来说，调整一下代码的顺序，
  #+BEGIN_SRC python
try:
  open('/root/test.txt')
except PermissionError:
  print('Permission Denied')
except Exception:
  print('error')
  #+END_SRC

  在抛出异常的时候，可以给异常代码传递一些信息：
  #+BEGIN_SRC python :results output :exports both
	class CustomException(Exception):
		def __init__(self, code, message):
			self.code = code
			self.message = message
	try:
		raise CustomException(500, 'internal error')
	except CustomException as e:
		print('<{}>{}'.format(e.code, e.message))
  #+END_SRC

#+RESULTS:
: <500>internal error
*** finally语句
  先来一段代码看看，
  #+BEGIN_SRC python
try:
  f = open('/root/read_only.txt')
  f.write('hehe\n') # 在这里抛出异常
  f.close() # 这个语句不能执行
except:
  print('open error')
  #+END_SRC
  以上这段代码执行完毕后，/root/read_only.txt文件不能被正常关闭。对
  上述代码进行稍微修改，使其可以关闭代码，这里使用finally语句，
  #+BEGIN_SRC python
f = None

try:
  f = open('/root/read_only.txt')
  f.write('hehe\n') # 在这里抛出异常
except:
  print('open error')
finally:
  print('close file')
  if f is not None:
	  f.close()
# 执行结果为
open error
close file
  #+END_SRC

  finally语句总是会执行，无论有没有抛出异常，所以清理工作，通常会放
  到finally语句块里执行。

  在Python中，try语句并不会开辟新的作用域。

  在看一个例子，主要是验证finally的执行时机：
  #+BEGIN_SRC python :results output :exports both
def fn():
  try:
	  print('try')
	  return # 遇到return，应该返回的，但finally语句块还是执行了。
  finally:
	  print('finally')

fn()
  #+END_SRC

#+RESULTS:
: try
: finally

  继续修改上面的例子，
  #+BEGIN_SRC python :results output :exports both
def fn():
  x = 2
  def inner(x):
	  print('inner')
	  return x + 1
  try:
	  print('try')
	  return x
  finally:
	  x = inner(3)

fn()
  #+END_SRC

#+RESULTS:
: try
: inner

  对上面的例子再做些修改，
  #+BEGIN_SRC python
def fn():
  x = [2]
  def inner(x):
	  print('inner')
	  return x + 1
  try:
	  print('try')
	  return x
  finally:
	  x[0] = inner(3)

fn()
try
inner
[4]
  #+END_SRC

  finally在return语句之后，函数返回之前执行。通常来说，不在finally里
  执行return。为了看清这个过程，可以做如下修改代码，
  #+BEGIN_SRC python
import time
def fn():
  def inner():
	  print('inner')
	  return 3
  try:
	  print('try')
	  return inner()
  finally:
	  time.sleep(3)
	  print('finally')

fn()
try
inner
# sleep(3)
finally
3
  #+END_SRC

  对于上面的例子，如果在finally语句块中执行return语句呢？inner()函数
  还会返回3吗？进行验证，
  #+BEGIN_SRC python
import time
def fn():
  def inner():
	  print('inner')
	  return 3
  try:
	  print('try')
	  return inner()
  finally:
	  print('finally')
	  return 5

fn()
try
inner
finally
5
  #+END_SRC

  由此，可以看出，finally总是会被执行。再看一例，
  #+BEGIN_SRC python
def fn():
  try:
	  1 / 0   # 抛出异常
	  yield 3 # 不会被执行
  except:
	  yield 4
  finally:
	  yield 5
  yield 6

for x in fn():
  print(x)

4
5
6
  #+END_SRC
**** type函数
   我们可以通过type()函数创建出Hello类，而无需通过class
   Hello(object)的定义。一个示例代码：
   #+BEGIN_SRC python :results output :exports both
	 def fn(self, name='world'):
		 print('Hello, %s.' % name)

	 if __name__ == '__main__':
		 # 创建Hello class
		 Hello = type('Hello', (object,), dict(hello=fn))
		 # 实例化
		 hello = Hello()
		 # 调用实例hello的hello方法
		 hello.hello()
		 print(type(Hello))
		 print(type(hello))
   #+END_SRC

#+RESULTS:
: Hello, world.
: <class 'type'>
: <class '__main__.Hello'>

要创建一个class对象，type()函数一次传入3个参数：
1. class的名称；
2. 继承的父类，注意Python支持多继承，如果只有一个父类，注意元组单元素的写法；
3. class的方法名称与函数绑定，这里我们把函数fn绑定到方法名hello上。

元类，继承自type的类，都叫元类。元类可以重写__new__方法，改变type的行为。
 #+BEGIN_SRC python
type(name, bases, attrs)
name: 类名字符串
bases: 继承的父类，是一个元组（如果只有一个父类，注意单元素元组的书写方法）
attrs: 属性字典（类绑定了哪些方法）

A = type('A', (object, ), {'b': 1})
a = A()
print(A, a.b)
 #+END_SRC

上述的代码运行结果为：
 #+BEGIN_SRC python :results output :exports both
   A = type('A', (object, ), {'b': 1})
   a = A()
   print(A, a.b)
 #+END_SRC

 #+RESULTS:
 : <class '__main__.A'> 1

一个简单的例子：
 #+BEGIN_SRC python :results output :exports both
   def howdy(self, you):
	   print('Howdy, ' + you)


   MyList = type('MyList', (list, ), dict(x=42, howdy=howdy))

   ml = MyList()
   ml.append("James")
   print(ml)
   print(ml.x)
   ml.howdy("John")
 #+END_SRC

 #+RESULTS:
 : ['James']
 : 42
 : Howdy, John

通过type()函数创建的类和直接写class是完全一样的，因为Python解释器遇到class定义时，仅仅是扫描一下class定义的语法，然后调用type()函数创建出class。
**** metaclass
除了使用type()动态创建类以外，要控制类的创建行为，还可以使用metaclass。metalass直译为元类。简单的解释就是：先定义metaclass，就可以创建类，最后创建实例。所以，metaclass允许我们创建类或者修改类。换句话说，我们可以把类看成是metaclass创建出来的“实例”。

来个例子，定义一个metaclass将我们自己定义的MyList增加一个add方法。定义ListMetaclass，按照默认习惯，metaclass的类名总是以Metaclass结尾，以便清楚地表示这是一个metaclass：
   #+BEGIN_SRC python :results output :exports both
	 # metaclass是类的模板，所以必须从type类型派生
	 class ListMetaclass(type):
		 def __new__(cls, name, bases, attrs):
			 attrs['add'] = lambda self, value: self.append(value)
			 return type.__new__(cls, name, bases, attrs)
   #+END_SRC

有了ListMetaclass，我们在定义类的时候还要指示使用ListMetaclass来定制类，传入关键字参数metaclass：
   #+BEGIN_SRC python :results output :exports both
	 class ListMetaclass(type):
		 def __new__(cls, name, bases, attrs):
			 attrs['add'] = lambda self, value: self.append(value)
			 return type.__new__(cls, name, bases, attrs)


	 class MyList(list, metaclass=ListMetaclass):
		 pass

	 # 测试
	 L = MyList()
	 L.add(1)
	 print(L)
   #+END_SRC

#+RESULTS:
: [1]

当我们传入关键字参数metaclass时，魔术就生效了，它指示Python解释器在创建MyList时，要通过ListMetaclass.new()来创建，在此，我们可以修改类的定义，比如，加上新的方法，然后，返回修改后的定义。

new()方法接收到的参数依次是：
1. 当前准备创建的类对象；
2. 类的名字；
3. 类继承的父类集合；
4. 类的方法集合。

动态修改有什么意义？直接在MyList定义中写add()方法不是更简单吗？正常情况下，确实应该直接写，通过metaclass修改纯属变态。

但是，总会遇到需要修改metaclass修改类定义的。ORM就是一个典型的例子。让我们来尝试编写一个ORM框架。
   #+BEGIN_SRC python :results output :exports both
	 class User(Model):
		 # 定义类的属性列的映射
		 id = IntegerField('id')
		 name = StringField('username')
		 email = StringField('email')
		 password = StringField('password')

	 # 创建一个实例
	 u = User(id=12345, name='Michael', email='test@163.com', password='mypass')
	 # 保存到数据库
	 u.save()
   #+END_SRC

其中，父类Model和属性类型StringField、IntegerField是由ORM框架提供的，剩下的魔术方法比如save()全部由metaclass自动完成。虽然metaclass的编写会比较复杂，但ORM的使用者使用起来却异常简单。

现在，我们就按上面的接口来实现该ORM。首先来定义Field类，它负责保存数据库表的字段名和字段类型：
   #+BEGIN_SRC python :results output :exports both
	 class Field:
		 def __init__(self, name, column_type):
			 self.name = name
			 self.column_type = column_type

		 def __str__(self):
			 return '<{}:{}>'.format(self.__class__.__name__, self.name)
   #+END_SRC

在Field的基础上，进一步定义各种类型的Field，比如StringField、IntegerField等等：
   #+BEGIN_SRC python :results output :exports both
	 class StringField(Field):
		 def __init__(self, name):
			 super(StringField, self).__init__(name, 'varchar(100)')


	 class IntegerField(Field):
		 def __init__(self, name):
			 super(IntegerField, self).__init__(name, 'bigint')
   #+END_SRC

下一步，就是编写最复杂的ModelMetaclass了：
   #+BEGIN_SRC python :results output :exports both
	 class ModelMetaclass(type):
		 def __new__(cls, name, bases, attrs):
			 if name == 'Model':
				 return type.__new__(cls, name, bases, attrs)
			 print('Fond model: {}'.format(name))
			 mappings = dict()
			 for k, v in attrs.items():
				 if isinstance(v, Field):
					 print('Found mapping: {} ==> {}'.format(k, v))
					 mappings[k] = v
			 for k in mappings.keys():
				 attrs.pop(k)
			 attrs['__mappings__'] = mappings
			 attrs['__table__'] = name
			 return type.__new__(cls, name, bases, attrs)
   #+END_SRC

编写基类Model：
   #+BEGIN_SRC python :results output :exports both
	 class Model(dict, metaclass=ModelMetaclass):
		 def __init__(self, **kw):
			 super(Model, self).__init__(**kw)

		 def __getattr__(self, key):
			 try:
				 return self[key]
			 except KeyError:
				 raise AttributeError(r"'Model' object has no attribute '{}'".format(key))

		 def __setattr__(self, key, value):
			 self[key] = value

		 def save(self):
			 fields = []
			 params = []
			 args = []
			 for k, v in self.__mappings__.items():
				 fields.append(v.name)
				 params.append('?')
				 args.append(getattr(self, k, None))
			 sql = 'INSERT INTO {} ({}) VALUES ({})'.format(self.__table__, ','.join(fields), ','.joins(params))
			 print('SQL: {}'.format(sql))
			 print('ARGS: {}'.format(str(args)))
   #+END_SRC

当用户定义一个class User(Model)时，Python解释器首先在当前类User的定义中查找metaclass，如果没有找到，就继续在父类Model中查找metaclass，找到了，就使用Model中定义的metaclass的ModelMetaclass来创建User类，也就是说，metaclass可以隐式地继承到子类，但子类自己却感觉不到。

在ModelMetaclass中，一共做了几件事情：
1. 排除掉对Model类的修改；
2. 在当前类（比如User）中查找定义的类的所有属性，如果找到一个Field属性，就把它保存到一个mappings的dict中，同时从类属性中删除该Field属性，否则，容易造成运行时错误（实例的属性会遮盖类的同名属性）；
3. 把表名保存到table中，这里简化为表名默认为类名。

我们实现了save()方法，把一个实例保存到数据库中。因为有表名，属性到字段的映射和属性值的集合，就可以构造出INSERT语句。

整个代码如下：
   #+BEGIN_SRC python :results output :exports both
	 class Field:
		 def __init__(self, name, column_type):
			 self.name = name
			 self.column_type = column_type

		 def __str__(self):
			 return '<{}:{}>'.format(self.__class__.__name__, self.name)


	 class StringField(Field):
		 def __init__(self, name):
			 super(StringField, self).__init__(name, 'varchar(100)')


	 class IntegerField(Field):
		 def __init__(self, name):
			 super(IntegerField, self).__init__(name, 'bigint')


	 class ModelMetaclass(type):
		 def __new__(cls, name, bases, attrs):
			 if name == 'Model':
				 return type.__new__(cls, name, bases, attrs)
			 print('Found model: {}'.format(name))
			 mappings = dict()
			 for k, v in attrs.items():
				 if isinstance(v, Field):
					 print('Found mapping: {} ==> {}'.format(k, v))
					 mappings[k] = v
			 for k in mappings.keys():
				 attrs.pop(k)
			 attrs['__mappings__'] = mappings
			 attrs['__table__'] = name
			 return type.__new__(cls, name, bases, attrs)


	 class Model(dict, metaclass=ModelMetaclass):
		 def __init__(self, **kw):
			 super(Model, self).__init__(**kw)

		 def __getattr__(self, key):
			 try:
				 return self[key]
			 except KeyError:
				 raise AttributeError(r"'Model' object has no attribute '{}'".format(key))

		 def __setattr__(self, key, value):
			 self[key] = value

		 def save(self):
			 fields = []
			 params = []
			 args = []
			 for k, v in self.__mappings__.items():
				 fields.append(v.name)
				 params.append('?')
				 args.append(getattr(self, k, None))
			 sql = 'INSERT INTO {} ({}) VALUES ({})'.format(self.__table__,
															','.join(fields),
															','.join(params))
			 print('SQL: {}'.format(sql))
			 print('ARGS: {}'.format(str(args)))


	 class User(Model):
		# 定义类的属性到列的映射：
		id = IntegerField('id')
		name = StringField('username')
		email = StringField('email')
		password = StringField('password')

	 if __name__ == '__main__':
		 u = User(id=12345, name='Michael', email='test@orm.org', password='my-pwd')
		 u.save()
   #+END_SRC

#+RESULTS:
: Found model: User
: Found mapping: id ==> <IntegerField:id>
: Found mapping: email ==> <StringField:email>
: Found mapping: name ==> <StringField:username>
: Found mapping: password ==> <StringField:password>
: SQL: INSERT INTO User (id,password,username,email) VALUES (?,?,?,?)
: ARGS: [12345, 'my-pwd', 'Michael', 'test@orm.org']

可以看到，save()方法已经打印出了可执行的SQL语句，以及参数列表，只需要真正连接到数据库，执行该SQL语句，就可以完成真正的功能。

不到100行代码，我们就通过metaclass实现了一个精简的ORM框架。

metaclass是Python中非常具有魔术性的对象，它可以改变类创建时的行为。 这种强大的功能使用起来务必小心。
** lru_cache
lru_cache的maxsize默认是128，如果为None，则表示不做任何限制。
#+BEGIN_SRC python :results output :exports both
import time
import datetime
import functools


def logger(fn):
	@functools.wraps(fn)
	def wrap(*args, **kwargs):
		start = datetime.datetime.now()
		ret = fn(*args, **kwargs)
		end = datetime.datetime.now()
		print('call {} took {}'.format(fn.__name__, end - start))
		return ret
	return wrap


@logger
@functools.lru_cache(3)
def sleep(x):
	time.sleep(x)
	return x

sleep(3)
print('--------------------')
sleep(3)
print('')
sleep(4)
print('--------------------')
sleep(4)
print('')
sleep(2)
print('--------------------')
sleep(2)
print('')
sleep(1)
print('--------------------')
sleep(1)
print('')
sleep(5)
print('--------------------')
sleep(5)
print('')
sleep(3)
print('--------------------')
sleep(3)

#+END_SRC

#+RESULTS:
#+begin_example
call sleep took 0:00:03.005144
--------------------
call sleep took 0:00:00.000007

call sleep took 0:00:04.005131
--------------------
call sleep took 0:00:00.000007

call sleep took 0:00:02.002709
--------------------
call sleep took 0:00:00.000007

call sleep took 0:00:01.004751
--------------------
call sleep took 0:00:00.000014

call sleep took 0:00:05.005150
--------------------
call sleep took 0:00:00.000012

call sleep took 0:00:03.005129
--------------------
call sleep took 0:00:00.000006
#+end_example

*** 需求分析
1. 读入（非结构化数据）
2. 提取有用信息，组成结构化数据
3. 分析
4. 保存结果

提取数据的代码：
#+BEGIN_SRC python :results output :exports both
line = '61.135.169.9 - - [10/Aug/2016:04:12:38 +0800] "GET /ueditor/php/upload/image/20160808/1470637584812198.png HTTP/1.1" 200 13317 "-" "Mozilla/5.0 (compatible; Baiduspider/2.0; +http://www.baidu.com/search/spider.html)"'


def extract(line):
	names = ('remote', '', '', 'time', 'request', 'status', 'length', '', 'ua')
	tmp = []
	ret = []
	split = True

	# 比正则表达式速度要快
	for c in line:
		if c == '[':
			split = False
			continue
		if c == ']':
			split = True
			continue
		if c == '"':
			split = not split
			continue
		if c == ' ' and split:
			ret.append(''.join(tmp))
			tmp.clear()
		else:
			tmp.append(c)
	ret.append(''.join(tmp))
	# 结果组合
	result = dict(zip(names, ret))
	# 删除空的
	result.pop('', None)
	return result


print(extract(line))
#+END_SRC

#+RESULTS:
: {
:    'time': '10/Aug/2016:04:12:38 +0800', 
:    'ua': 'Mozilla/5.0 (compatible; Baiduspider/2.0; +http://www.baidu.com/search/spider.html)', 
:    'remote': '61.135.169.9', 
:    'status': '200', 
:    'length': '13317', 
:    'request': 'GET /ueditor/php/upload/image/20160808/1470637584812198.png HTTP/1.1'
: }

针对上述的结果进行一些转换，如time要转换为datetime格式，status要转
换为数字等。
#+BEGIN_SRC python :results output :exports both
import datetime
from collections import namedtuple

Request = namedtuple('Request', ['method', 'url', 'version'])

def request(src: str) -> Request:
	return Request(*src.split())

print(request('GET /robots.txt HTTP/1.1'))
#+END_SRC

#+RESULTS:
: Request(method='GET', url='/robots.txt', version='HTTP/1.1')

继续写转换：
#+BEGIN_SRC python :results output :exports both
import datetime
from collections import namedtuple

Request = namedtuple('Request', ['method', 'url', 'version'])
MapItem = namedtuple('MapItem', ['name', 'convert'])

mapping = [
	MapItem('remote', lambda x: x),
	MapItem('', None),
	MapItem('', None),
	MapItem('time', lambda x: datetime.datetime.strptime(x, '%d/%b/%Y:%H:%M:%S %z')),
	MapItem('request', lambda x: Request(*x.split())),
	MapItem('status', int),
	MapItem('length', int),
	MapItem('', None),
	MapItem('ua', lambda x: x)
]
#+END_SRC

extract函数的代码为：
#+BEGIN_SRC python :results output :exports both
import datetime
from collections import namedtuple

line = '61.135.169.9 - - [10/Aug/2016:04:12:38 +0800] "GET /ueditor/php/upload/image/20160808/1470637584812198.png HTTP/1.1" 200 13317 "-" "Mozilla/5.0 (compatible; Baiduspider/2.0; +http://www.baidu.com/search/spider.html)"'

Request = namedtuple('Request', ['method', 'url', 'version'])
MapItem = namedtuple('MapItem', ['name', 'convert'])

mapping = [
	MapItem('remote', lambda x: x),
	MapItem('', None),
	MapItem('', None),
	MapItem('time', lambda x: datetime.datetime.strptime(x, '%d/%b/%Y:%H:%M:%S %z')),
	MapItem('request', lambda x: Request(*x.split())),
	MapItem('status', int),
	MapItem('length', int),
	MapItem('', None),
	MapItem('ua', lambda x: x)
]


def extract(line):
	tmp = []
	ret = []
	split = True

	# 比正则表达式速度要快
	for c in line:
		if c == '[':
			split = False
			continue
		if c == ']':
			split = True
			continue
		if c == '"':
			split = not split
			continue
		if c == ' ' and split:
			ret.append(''.join(tmp))
			tmp.clear()
		else:
			tmp.append(c)
	ret.append(''.join(tmp))
	# 结果组合
	result = dict()
	for i, item in enumerate(mapping):
		if item.name:
			result[item.name] = item.convert(ret[i])
	return result

print(extract(line))
#+END_SRC

#+RESULTS:
: {'request': Request(method='GET', url='/ueditor/php/upload/image/20160808/1470637584812198.png', version='HTTP/1.1'), 'status': 200, 'time': datetime.datetime(2016, 8, 10, 4, 12, 38, tzinfo=datetime.timezone(datetime.timedelta(0, 28800))), 'ua': 'Mozilla/5.0 (compatible; Baiduspider/2.0; +http://www.baidu.com/search/spider.html)', 'remote': '61.135.169.9', 'length': 13317}

使用正则的方式解析：
#+BEGIN_SRC python :results output :exports both
import re
import datetime

mapping = {
	'length': int,
	'request': lambda x: Request(*x.split()),
	'status': int,
	'time': lambda x: datetime.datetime.strptime(x, '%d/%b/%Y:%H:%M:%S %z')
}

line = '66.249.69.44 - - [11/Aug/2016:04:31:25 +0800] "GET /18051 HTTP/1.1" 200 13551 "-" "Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)"'
regex = r'(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}) - - \[(.*)\] "(.*)" (\d+) (\d+) ".*" "(.*)"'
m = re.match(regex, line)
print(m.groups())
#+END_SRC

#+RESULTS:
: ('66.249.69.44', '11/Aug/2016:04:31:25 +0800', 'GET /18051 HTTP/1.1', '200', '13551', 'Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)')

使用命名捕获，
#+BEGIN_SRC python :results output :exports both
# (?P<name>) 命名捕获
import re
import datetime
from collections import namedtuple

Request = namedtuple('Request', ['method', 'url', 'version'])
line = '66.249.69.44 - - [11/Aug/2016:04:31:25 +0800] "GET /18051 HTTP/1.1" 200 13551 "-" "Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)"'
regex = r'(?P<remote>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}) - - \[(?P<time>.*)\] "(?P<request>.*)" (?P<status>\d+) (?P<length>\d+) ".*" "(?P<ua>.*)"'
# pattern编译之后，速度有提升 (AST)
matcher = re.compile(regex)

mapping = {
	'length': int,
	'request': lambda x: Request(*x.split()),
	'status': int,
	'time': lambda x: datetime.datetime.strptime(x, '%d/%b/%Y:%H:%M:%S %z')
}


def extract(line):
	m = matcher.match(line)
	if m:
		ret = m.groupdict()
		return {k:mapping.get(k, lambda x: x)(v) for k, v in ret.items()}
	raise Exception(line)

print(extract(line))
#+END_SRC

#+RESULTS:
: {'length': 13551, 
:  'ua': 'Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', 
:  'request': Request(method='GET', url='/18051', version='HTTP/1.1'), 
:  'remote': '66.249.69.44', 
:  'time': datetime.datetime(2016, 8, 11, 4, 31, 25, tzinfo=datetime.timezone(datetime.timedelta(0, 28800))), 
:  'status': 200}

数据提取功能完成后，接下来 *载入数据*,
#+BEGIN_SRC python :results output :exports both
def load(path):
	with open(path) as f:
		try:
			yield extract(f.readline())
		except:
			pass
#+END_SRC
** 实现base64编码解码算法
base64主要用于把二进制转换为字符串。

base64的table： "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz01234567890+/"

1. 输入按3字节（24位）分组，不足3字节补0
2. 按6位分组，转化为整数
3. 整数作为table的索引
4. 补0的字节用=表示

首先把该问题分解为几个步骤：
1. 要被编码的字节进行以3个字节为单位进行分组
 #+BEGIN_SRC python :results output :exports both
   data = b'abcdefg'
   c = 0
   for x in range(3, len(data), 3):
	   print(data[c:x])
	   c += 3
 #+END_SRC

 #+RESULTS:
 : b'abc'
 : b'def'

2. 把分组得到的字节转化为整数
 #+BEGIN_SRC python :results output :exports both
   # int类型有一个from_bytes的方法，可以把二进制转换为整数
   print(int.from_bytes(b'abc', 'big'))
 #+END_SRC

 #+RESULTS:
 : 6382179

3. 得到每个分组的3个字节（共24位）以6位为单位进行分组
 #+BEGIN_SRC python :results output :exports both
   i = 6382179
   # 取第一个6位，右移18位即可
   print(i >> 18)

   # 取第二个6位，右移12位并与0b111111做与操作
   print(i >> 12 & 0b111111) # hex(0b111111)

   # 取第三个6位，右移6位并与0b111111做与操作
   print(i >> 6 & 0b111111)

   # 取第四个6位，直接与0b111111做与操作
   print(i & 0b111111)
 #+END_SRC

 #+RESULTS:
 : 24
 : 22
 : 9
 : 35

4. 以上个步骤得到的数字为索引，从table中取出相应的编码
 #+BEGIN_SRC python :results output :exports both
   table = b'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz01234567890+/'
   arr = bytearray()
   arr.extend([table[24], table[22], table[9], table[35]])
   print(arr)
 #+END_SRC

 #+RESULTS:
 : bytearray(b'YWJj')

*** base64编码
#+BEGIN_SRC python :results output :exports both
def b64encode(data: bytes) -> str:
	table = b'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz01234567890+/'
	encoded = bytearray()
	c = 0
	for x in range(3, len(data)+1, 3):
		print(data[c:x])
		i = int.from_bytes(data[c:x], 'big')
		for j in range(1, 5):
			encoded.append(table[i >> (24-j*6) & 0x3f])
		c += 3
	r = len(data) - c
	if r > 0:
		i = int.from_bytes(data[c:], 'big') << (3-r) * 8
		for j in range(1, 5-(3-r)):
			encoded.append(table[i >> (24-j*6) & 0x3f])
		for _ in range(3-r):
			encoded.append(int.from_bytes(b'=', 'big'))
	return encoded.decode()

print(b64encode(b'abcdefg'))
#+END_SRC

#+RESULTS:
: b'abc'
: b'def'
: YWJjZGVmZw==

*** base64解码
#+BEGIN_SRC python :results output :exports both
def b64decode(data: str) -> bytes:
	table = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuwxyz0123456789+/'
	decoded = bytearray()
	s = 0
	for e in range(4, len(data)+1, 4):
		tmp = 0
		for i, c in enumerate(data[s:e]):
			if c != '=':
				tmp += table.index(c) << 24 - (i+1) * 6
			else:
				tmp += 0 << 24 - (i+1) * 6
		decoded.extend(tmp.to_bytes(3, 'big'))
		s += 4
	return bytes(decoded.rstrip(b'\x00'))

e = 'YWJj'
print(b64decode(e))
#+END_SRC

#+RESULTS:
: b'abc'

** 实现计数器，可以指定基数和步长
我的实现（有点不符合题意）：
#+BEGIN_SRC python :results output :exports both
def make_inc(base=0, step=1):
	 def counter():
		 x = base
		 while True:
			 x += step
			 yield x
	 c = counter()
	 return lambda: next(c)

incr = make_inc(0, 1)
for i in range(3):
	 print(incr())
print('--------------------')
incr = make_inc(1, 2)
for i in range(3):
	 print(incr())
#+END_SRC

#+RESULTS:
: 1
: 2
: 3
: --------------------
: 3
: 5
: 7

听课时的笔记：
#+BEGIN_SRC python :results output :exports both
def counter(i):
	base = i
	def inc(x=1):
		nonlocal base
		base += x
		return base
	return inc

inc = counter(3)
print(inc(3))
#+END_SRC

#+RESULTS:
: 6

** cache装饰器
实现可过期，可清除，不换出。

实现LRU换出。
#+BEGIN_SRC python :results output :exports both
from functools import wraps
import inspect
import datetime


def cache(exp=0):
	def _cache(fn):
		cache = {}
		@wraps(fn)
		def wrap(*args, **kwargs):
			# TODO key 如何拼装
			key = []
			names = set()
			params = inspect.signature(fn).parameters
			# 以下4行是对位置参数的处理
			for i, arg in enumerate(args):
				name = list(params.keys())[i]
				key.append((name, arg))
				names.add(name)
			# 下面一行是对关键字参数的处理
			key.extend(kwargs.items())
			names.update(kwargs.keys())
			# 对默认参数的处理
			for k, v in params.items():
				if k not in names:
					key.append((k, v.default))
			# 对key进行排序
			key.sort(key=lambda x: x[0])
			key = '&'.join(['{}={}'.format(name, arg) for name, arg in key])
			print(key)
			if key in cache.keys():
				ret, timestamp = cache[key]
				if exp == 0 or datetime.datetime.now().timestamp() - timestamp < exp:
					print('cache hit')
					return ret
			ret = fn(*args, **kwargs)
			print('cache miss')
			cache[key] = (ret, datetime.datetime.now().timestamp())
			return ret
		return wrap
	return _cache


@cache(5)
def add(x, y=3):
	return x + y

add(1, 3)
#+END_SRC

#+RESULTS:
: x=1&y=3
: cache miss

** 实现优先队列
1. 完全有序，入队的时候做一次排序
 #+BEGIN_SRC python :results output :exports both
   queue = []


   def queue():
	   lst = []

	   def put(value, priority):
		   for i, item in enumerate(lst):
			   if item[1] <= priority:
				   lst.insert(i, (value, priority))
				   break
		   else:
			   lst.append((value, priority))

	   def pop():
		   if lst:
			   return lst.pop()[0]
		   return None

	   return put, pop

   put, pop = queue()
   put(1, 1)
   put(3, 2)
   put(5, 5)

   print(pop())
   print(pop())
 #+END_SRC

 #+RESULTS:
 : 1
 : 3

2. heap实现
 + heap是完全二叉树
 + 父节点总是比子节点大（小）
 + 完全二叉树可以使用列表表示
   + data[0]是根节点
   + data[i].left = data[2i+1]
   + data[i].right = data[2i+2]
   + data[i].parent = data[floor((i-1)/2)]

** 实现一个优先队列，由用户指定比较函数
#+BEGIN_SRC python :results output :exports both
# 命名元组
from collections import namedtuple

t = (1, 2, 3)
t[0]
1
User = namedtuple('User', ['name', 'mail', 'age'])
user = User('lavenliu', 'lcc@lavenliu.cn', 18)
print(user)
type(user)
print(user.name)
print(user.age)
#+END_SRC

#+RESULTS:
: User(name='lavenliu', mail='lcc@lavenliu.cn', age=18)
: lavenliu
: 18

** 实现contextlib.contextmanager装饰器
第九周作业：
#+BEGIN_SRC python :results output :exports both
from functools import wraps


class ContextManager:
	def __init__(self, fn, *args, **kwargs):
		self.gen = fn(*args, **kwargs)

	def __enter__(self):
		return next(self.gen)

	def __exit__(self, *args):
		try:
			return next(self.gen)
		except StopIteration as e:
			return False


def contextmanager(fn):
	@wraps(fn)
	def wrap(*args, **kwargs):
		return ContextManager(fn, *args, **kwargs)
	return wrap


@contextmanager
def context():
	'''example context'''
	print('setup')
	try:
		yield 'value'
	finally:
		print('cleanup')

help(context)
#+END_SRC

#+RESULTS:
: Help on function context in module __main__:
: 
: context()
:     example context
: 

** org-mode python session
#+BEGIN_SRC python :session
def foo(x):
	if x > 0:
		return x+1
	else:
		return x-1

foo(1)
#+END_SRC

#+RESULTS:
: 2
** org-mode python non-session
使用return()，
#+BEGIN_SRC python
def foo(x):
	if x > 0:
		return x+1
	else:
		return x-1

return foo(5)
#+END_SRC

#+RESULTS:
: 6

#+begin_src python :session :results file
import matplotlib
matplotlib.use('Agg')
import matplotlib.pyplot as plt
fig=plt.figure(figsize=(3,2))
plt.plot([1,3,2])
fig.tight_layout()
plt.savefig('images/myfig.pdf')
'images/myfig.pdf' # return this to org-mode
#+end_src

#+RESULTS:
[[file:images/myfig.pdf]]

